rexolboy8/ru-freebsd-man/man7/release.7
.\" Авторское право (c) 2002 Murray Stokely <murray@FreeBSD.org>
.\" Все права защищены.
.\"
.\" Распространение и использование в исходном коде и двоичном формате, с
.\" изменениями или без них, разрешено при соблюдении следующих условий:
.\" 1. При повторном распространении исходного кода должны сохраняться вышеуказанное
.\"    уведомление об авторских правах, этот список условий и следующий отказ от ответственности.
.\" 2. При повторном распространении в двоичной форме должны воспроизводиться вышеуказанное
.\"    уведомление об авторских правах, этот список условий и следующий отказ от ответственности в
.\"    документации и/или других материалах, прилагаемых к дистрибутиву.
.\"
.\" ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ "КАК ЕСТЬ", И
.\" МЫ НЕ ДАЕМ НИКАКИХ ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ, ВКЛЮЧАЯ
.\" ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ И Т.П.
.\" АВТОР НИ В КОЕМ СЛУЧАЕ НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ
.\" ЗА ЛЮБОЙ ПРЯМОЙ, КОСВЕННЫЙ, СЛУЧАЙНЫЙ, ОСОБЫЙ, ПОКАЗАТЕЛЬНЫЙ ИЛИ ЛОГИЧЕСКИ ВЫТЕКАЮЩИЙ
.\" УЩЕРБ (ВКЛЮЧАЯ: ПРИОБРЕТЕНИЕ ЗАМЕНЯЮЩИХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЮ ВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ,
.\" ДАННЫХ ИЛИ ПРИБЫЛИ; ПЕРЕБОИ В РАБОТЕ)
.\" НЕЗАВИСИМО ОТ ПРИЧИН И ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БУДЬ ТО В КОНТРАКТЕ,
.\" ИЛИ ПРАВОНАРУШЕНИЕ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ИНОЕ ПРАВОНАРУШЕНИЕ ИНЫМ ОБРАЗОМ),
.\" ВОЗНИКАЮЩЕЕ КАКИМ-ЛИБО ОБРАЗОМ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ,
.\" ДАЖЕ ЕСЛИ ВЫ БЫЛИ ПРЕДУПРЕЖДЕНЫ О ВОЗМОЖНОСТИ ТАКОГО УЩЕРБА.
.\"
.Dd Август 6, 2023
.Dt RELEASE 7
.Os
.Sh НАИМЕНРВАНИЕ
.Nm release
.Nd "создание инфраструктуры для релиза"
.Sh ОПИСАНИЕ
.Fx
предоставляет полноценную среду сборки,
позволяющую пользователям создавать полноценные версии операционной системы
.Fx .
Все инструменты, необходимые для сборки версии, доступны из хранилища исходного кода
.Fx
в разделе
.Pa src/release .
Полная версия может быть создана с помощью всего одной команды,
включая создание ISO-образов, пригодных для записи на CD-ROM,
карт памяти и сетевого каталога установки. Эта команда удачно названа
.Dq Li "make release" .
.Pp
Для некоторых пользователей может оказаться желательным
предоставить абсолютно чистую среду сборки, 
без каких-либо локальных изменений в дереве исходных текстов или в
.Xr make.conf 5 ,
также с чистым извлечением определенных версий деревьев doc, src и портов. 
Для этой цели предоставляется скрипт
.Pq Pa src/release/release.sh
который автоматизирует эти проверки, а затем выполняет
.Dq Li "make release"
в чистом
.Xr chroot 8 .
.Pp
Прежде чем приступить к сборке версии, пользователь должен ознакомиться с содержимым
.Xr build 7 ,
и иметь опыт обновления систем из исходного кода.
.Pp
Процесс сборки релиза требует, чтобы файл
.Pa /usr/obj
был заполнен выводами
.Dq Li "make buildworld"
и
.Dq Li "make buildkernel" .
Это необходимо для предоставления объектных файлов для выпуска или, при использовании
.Pa release.sh ,
для того, чтобы объектные файлы для всей системы можно было установить в чистую среду
.Xr chroot 8 .
.Pp
Если сборка целевого выпуска предназначена для другой архитектуры
или типа компьютера, необходимо использовать переменные
.Va TARGET
и
.Va TARGET_ARCH .
Дополнительные сведения см. в разделе
.Fa release.conf .
.Pp
Процедура выпуска на некоторых архитектурах может также потребовать, чтобы драйвер устройства
.Xr md 4
(диск памяти) присутствовал в ядре
.Pq ибо был скомпилирован, либо доступен в виде модуля .
.Pp
Этот документ не охватывает управление исходным кодом,
обеспечение качества или другие аспекты процесса разработки релиза.
.Sh СОЗДАНИЕ ЧИСТОГО РЕЛИЗА
Официальные релизы
.Fx
выпускаются в чистой среде, чтобы обеспечить
согласованность между версиями src,
портов и деревьев документов и избежать заражения со стороны хост-системы
.Po например, локальными исправлениями, изменениями
в
.Xr make.conf 5 ,
и т.д..
.Pc .
Это достигается с помощью сценария-оболочки
.Pa src/release/release.sh .
.Pp
.Ic release.sh
.Op Fl c Ar release.conf
.Pp
.Ic release.sh
проверяет деревья
.Li src/ ,
.Li ports/ ,
и
.Li doc/
в
.Va CHROOTDIR ,
затем вызывает
.Dq Li "make buildworld"
и
.Dq Li "make installworld"
чтобы создать среду
.Xr chroot 8 .
Затем запускается команда 
.Dq Li "make release"
в среде
.Xr chroot 8
которая помещает результат в
.Pa $CHROOTDIR/R .
.Pp
Дополнительный конфигурационный файл
.Fa release.conf
поддерживает следующие переменные:
.Bl -tag -width Ev
.It Va CHROOTDIR
Каталог, в пределах которого будет создан релиз.
.It Va CHROOT_MAKEENV
Необходимо передать дополнительные аргументы
.Xr make 1 ,
которые непосредственно влияют на настройку chroot сборки.
.It Va NOGIT
Не требуется явно устанавливать порт
.Xr git 1 .
.It Va GITROOT
Узел
.Xr git 1
используемый для проверки различных деревьев.
По умолчанию используется значение
.Pa https://git.FreeeBSD.org .
.It Va SRCBRANCH
Использует
.Li src/ .
По умолчанию используется
.Fl b Va main .
.It Va PORTBRANCH
Использует
.Li ports/ .
По умолчанию используется
.Va head/@rHEAD .
.It Va TARGET
Целевой тип компьютера для перекрестного создания релиза.
.It Va TARGET_ARCH
Архитектура целевой машины для перекрестного создания релиза.
.Pp
Для получения списка поддерживаемых комбинаций
.Va TARGET
и
.Va TARGET_ARCH
обратитесь к выводам
.Dq make targets
как описано в
.Xr build 7 .
.It Va KERNEL
Используемая целевая конфигурация ядра. По умолчанию используется
.Va GENERIC .
Можно указать несколько параметров ядра
.Va KERNEL .
.It Va MAKE_CONF
Файл
.Xr make.conf 5
который будет использоваться для сборки релиза. По умолчанию используется
.Fa /dev/null ,
чтобы предотвратить загрязнение релиза локальными системными изменениями.
.It Va SRC_CONF
Файл
.Xr src.conf 5 ,
который будет использоваться для сборки релиза. По умолчанию используется
.Fa /dev/null ,
чтобы предотвратить загрязнение релиза локальными системными изменениями.
.It Va MAKE_FLAGS
Дополнительные флаги для передачи
.Xr make 1 .
.It Va WORLD_FLAGS
Дополнительные флаги, которые необходимо передать в
.Xr make 1
на этапе
.Dq buildworld .
По умолчанию количество заданий
.Xr make 1
.Pq Ar -j
устанавливается равным количеству процессоров,
доступных в системе с поддержкой SMP.
.It Va KERNEL_FLAGS
Дополнительные флаги, которые необходимо передать в
.Xr make 1
на этапе
.Dq buildkernel .
о умолчанию количество заданий
.Xr make 1
.Pq Ar -j
равно половине количества процессоров, доступных в системе с поддержкой SMP.
.It Va NOPORTS
Установите непустое значение, чтобы пропустить проверку
.Li ports/ .
Если оно установлено,
.Va NOPORTS
не будет препятствовать созданию дистрибутивного пакета
.Fa ports.txz .
.It Va WITH_DVD
Установите непустое значение, чтобы включить целевой
.Cm dvdrom .
.It Va WITH_COMPRESSED_IMAGES
Установите непустое значение, чтобы сжать исходные изображения с помощью
.Xr xz 1 .
Исходные
.Pq несжатые
изображения не удаляются.
.It Va XZ_THREADS Pq Vt int
Задает количество потоков, которые
.Xr xz 1
должен использовать при сжатии изображений.
По умолчанию для параметра
.Va XZ_THREADS
установлено значение
.Va 0 ,
то означает использование всех доступных ядер в системе.
.It Va VCSCMD
Команда, запущенная для получения деревьев исходных текстов.
По умолчанию используется
.Qq Cm git clone Fl q .
.It Va CHROOTBUILD_SKIP
Если это определено, этапы
.Li buildworld ,
.Li installworld ,
и
.Li distribution
при настройке среды сборки
.Xr chroot 8
пропускаются.
Это предназначено исключительно для случаев, когда пользовательская среда
.Xr chroot 8
предоставляется альтернативными способами.
.It Va SRC_UPDATE_SKIP
Установливает непустое значение, чтобы предотвратить проверку или обновление
.Fa /usr/src
в
.Xr chroot 8 .
Это предназначено для использования только в том случае, если ожидается, что
.Fa /usr/src
будет существовать альтернативным способом.
.It Va PORTS_UPDATE_SKIP
Установите непустое значение, чтобы предотвратить проверку или обновление
.Fa /usr/ports
в
.Xr chroot 8 .
Это предназначено для использования только в том случае, если ожидается, что
.Fa /usr/ports
будет существовать альтернативными способами.
.El
.Sh ВСТРОЕННЫЕ СБОРКИ
Следующие переменные
.Fa release.conf
относятся только к сборкам релизов для встраиваемых систем:
.Bl -tag -width Ev
.It Va EMBEDDEDBUILD
Установите ненулевое значение,
чтобы включить функциональность для выпусков встроенных устройств.
.Pp
Если параметр установлен, значение
.Va WITH_DVD
не задано.
Кроме того, также должны быть определены
.Va EMBEDDED_TARGET
и
.Va EMBEDDED_TARGET_ARCH .
Когда среда сборки создана,
.Fa release.sh
запускается отдельный скрипт сборки, расположенный в каталоге,
относящемся к конкретной архитектуре, в
.Pa src/release/${EMBEDDED_TARGET}/ .
.It Va EMBEDDEDPORTS
Укажите список всех портов, которые требуются для целевого устройства, в формате
.Fa category/port .
.It Va EMBEDDED_TARGET
Когда он установлен, его значение передается в
.Xr make 1
чтобы установить
.Va TARGET
.Pq значение of Cm uname Fl m
для перекрестного создания целевой пользовательской области.
.It Va EMBEDDED_TARGET_ARCH
Когда он установлен, его значение передается в
.Xr make 1
чтобы задать
.Va TARGET_ARCH
.Pq значение  of Cm uname Fl p
для перекрестного построения целевой пользовательской области.
.El
.Sh ОБРАЗЫ ДИСКОВ ВИРТУАЛЬНЫХ МАШИН
Следующие переменные
.Fa release.conf
относятся только к сборкам образов дисков виртуальной машины:
.Bl -tag -width Ev
.It Va WITH_VMIMAGES
Установkbdftn ненулевое значение для создания образов дисков
виртуальной машины в рамках сборки релиза.
.Va WITH_VMIMAGES
акже могут быть указаны в качестве переменной среды, передаваемой в
.Xr make 1 .
.It Va WITH_COMPRESSED_VMIMAGES
Задаtn ненулевое значение для сжатия образов дисков виртуальных машин с помощью
.Xr xz 1
в рамках целевой  
.Cm установки
.Xr make 1 .
Обратите внимание, что в некоторых системах сжатие образов дисков
виртуальных машин может занять очень много времени.
.It Va VMBASE
Устанавливается для изменения имени результирующего файла образа диска виртуальной машины.
Значение по умолчанию
.Va vm .
.It Va VMSIZE
Устанавливается для изменения размера емкости диска виртуальной машины.
Значение по умолчанию
.Va 20g .
Допустимые значения приведены в
.Xr makefs 8 .
.Pp
образы дисков виртуальных машин по умолчанию создаются в виде разреженных образов.
При использовании
.Va WITH_COMPRESSED_VMIMAGES
результирующие файлы, сжатые с помощью
.Xr xz 1 ,
сжимаются примерно до одинакового размера,
независимо от указанного размера образа диска.
.It Va VMFS
(Устарело.)
Задается для указания того, какая из файловых систем, перечисленных в
.Va VMFSLIST
связана с именем файла, не помеченным файловой системой. Допустимые значения
.Va ufs
и
.Va zfs .
Значение по умолчанию
.Va ufs .
.It Va VMFSLIST
Задается для указания списка типов файловых систем, для которых будут создаваться образы.
Допустимые значения - один или оба из
.Va ufs
и
.Va zfs .
Значение по умолчанию
.Va ufs zfs .
.It Va VMFORMATS
Выберите целевой формат(ы) образа виртуального диска для создания.
о умолчанию создаются форматы
.Va vhdf , Va vmdk , Va qcow2 ,
и
.Va raw .
Допустимые значения формата приведены в
.Xr mkimg 1 .
.El
.Pp
Чтобы получить список поддерживаемых
.Va VMFORMATS
фоматов
.Pq включая форматы провайдеров облачного хостинга
вместе с кратким описанием, запустите:
.Bd -literal -offset indent
cd /usr/src
make -C release list-vmtargets
.Ed
.Sh ОБРАЗЫ ИЗОБРАЖЕНИЯ МАШИН ДЛЯ ОБЛАЧНОГО ХОСТИНГА
Инструменты сборки версии
.Fx
поддерживают создание образов виртуальных машин для
различных облачных хостинг-провайдеров,
каждый из которых имеет свою собственную конфигурацию,
чтобы по умолчанию включать поддержку каждого хостинг-провайдера.
.Pp
Поддерживаются следующие переменные среды
.Xr make 1 :
.Bl -tag -width Ev
.It Va CLOUDWARE
Указывается список одного или нескольких провайдеров облачного хостинга,
заключенный в кавычки. Также требуется установить
.Va WITH_CLOUDWARE .
.It Va WITH_CLOUDWARE
Установите непустое значение,
чтобы разрешить создание образов виртуальных машин
для различных поставщиков облачного хостинга. Также требуется установить
.Va CLOUDWARE .
.El
.Pp
Кроме того, переменные
.Va CLOUDWARE
и
.Va WITH_CLOUDWARE
могут быть добавлены в
.Pa release.conf ,
и использоваться совместно с
.Pa release.sh .
.Pp
Для получения списка поддерживаемых значений
.Va CLOUDWARE
запустите:
.Bd -literal -offset indent
cd /usr/src
make -C release list-cloudware
.Ed
.Sh ЦЕЛЕВЫЕ ОБЪЕКТЫ MAKEFILE
Файл релиза
.Pq Pa src/release/Makefile
довольно сложен.
Большинство разработчиков будут иметь дело только с целями
.Cm релиза
и
.Cm установки .
.\" XXX: Что-то вроде введения к этому списку?  У всех остальных он есть.
.Bl -tag -width ".Cm packagesystem"
.It Cm release
Мета-цель для создания всех релизных носителей и дистрибутивов,
применимых к этой платформе.
.It Cm install
Скопируйте все подготовленные релизные носители в
.Pa ${DESTDIR} .
.It Cm cdrom
Создает образы установочных компакт-дисков.
Для этого может потребоваться, чтобы драйвер устройства
.Xr md 4
(диск памяти) присутствовал в ядре
(либо был скомпилирован, либо доступен в виде модуля).
На выводе этого целевого устройства создаются файлы с именами
.Pa disc1.iso
и
.Pa bootonly.iso .
.It Cm dvdrom
Создает установочные образы DVD-ROM.
Для этого может потребоваться, чтобы драйвер устройства
.Xr md 4
(диск памяти) присутствовал в ядре (либо был скомпилирован,
либо доступен в виде модуля).
На выводе этого целевого устройства создается файл
.Pa dvd1.iso .
.It Cm memstick
Создает установочный образ карты памяти с именем
.Pa memstick.img .
Применимо не на всех платформах. Требуется, чтобы драйвер устройства
.Xr md 4
.Pq диск памяти
присутствовал в ядре
.Pq либо был скомпилирован, либо доступен в виде модуля .
.It Cm mini-memstick
Аналогично
.Cm memstick ,
за исключением того, что установочные дистрибутивы в комплект не входят.
.It Cm ftp
Создает каталог с именем
.Pa ftp ,
содержащий дистрибутивные файлы,
используемые в сетевых установках и подходящие для загрузки на FTP-зеркало.
.It Cm vm-image
оздает образы дисков виртуальных машин в различных форматах. Целевой объект
.Cm vm-image
требует, чтобы переменной
.Va WITH_VMIMAGES
среды
.Xr make 1
было присвоено ненулевое значение.
.It Cm vm-cloudware
Создает образы виртуальных машин
.Fx
для различных провайдеров облачного хостинга.
Подробности о реализации смотрите в разделе
.Qq CLOUD HOSTING MACHINE IMAGES .
.It Cm list-cloudware
Отображает список допустимых значений
.Va CLOUDWARE .
.It Cm list-vmtargets
Отображает список допустимых
.Va VMFORMATS
и значений
.Va CLOUDWARE .
.El
.Pp
Основные подцелевые показатели, указанные в вышеприведенных целях:
.Bl -tag -width ".Cm packagesystem"
.It Cm packagesystem
Генерирует все дистрибутивные архивы
.Pq base, kernel, ports, doc
применимые к данной платформе.
.It Cm disc1
Создает загрузочную установочную систему,
содержащую все файлы дистрибутива, упакованные целевой системой
.Cm packagesystem
и пригодные для создания образов на
.Cm cdrom ,
.Cm dvdrom
и
.Cm memstick .
.It Cm reldoc
Создает документацию по выпуску.
Она включает в себя примечания к выпуску,
руководство по аппаратному обеспечению и инструкции по установке.
Другая документация, такая как Handbook,
создается во время создания целевого файла
.Cm base.txz ,
вызываемого
.Cm packagesystem .
.El
.Sh ОКРУЖЕНИЕ
Необязательные переменные:
.Bl -tag -width ".Ev TARGET_ARCH"
.It Ev OSRELEASE
Необязательное базовое имя для создаваемых образов мультимедиа при вызове цели
.Cm установки
.Pq например, FreeBSD-12.1-RELEASE-amd64 .
о умолчанию используется вывод
.Ic `uname -s`-`uname -r`-`uname -p`
прямо в chroot.
.It Ev WORLDDIR
Расположение каталога, содержащего дерево src.
о умолчанию это каталог, расположенный над каталогом, содержащим
.Pq Pa src .
.It Ev PORTSDIR
Расположение каталога, содержащего дерево портов. По умолчанию используется
.Pa /usr/ports .
сли он не задан или не может быть найден, порты не будут включены в релиз.
.It Ev NOPORTS
Если определена, коллекция портов будет исключена из релиза.
.It Ev NOSRC
Если задано, не включает исходный код системы в релиз.
.It Ev TARGET
Целевая аппаратная платформа. Это аналогично выводу
.Dq Nm uname Fl m .
Это необходимо для перекрестной сборки некоторых целевых архитектур.
Например, для перекрестной сборки для машин ARM64 требуется
.Ev TARGET_ARCH Ns = Ns Li aarch64
и
.Ev TARGET Ns = Ns Li arm64 .
Если этот параметр не задан, по умолчанию используется текущая аппаратная платформа
.Ev TARGET .
.It Ev TARGET_ARCH
Архитектура процессора целевой машины. Это аналогично результату
.Dq Nm uname Fl p .
Установите это значение для перекрестной сборки для другой архитектуры.
Если параметр не задан, значение параметра
.Ev TARGET_ARCH
по умолчанию соответствует текущей архитектуре компьютера,
если только также не задано значение
.Ev TARGET ,
и в этом случае по умолчанию используется значение,
соответствующее данной платформе.
Как правило, требуется только установить значение
.Ev TARGET .
.El
.Sh ФАЙЛЫ
.Bl -tag -compact -width Pa
.It Pa /usr/doc/Makefile
.It Pa /usr/doc/share/mk/doc.project.mk
.It Pa /usr/ports/Mk/bsd.port.mk
.It Pa /usr/ports/Mk/bsd.sites.mk
.It Pa /usr/share/examples/etc/make.conf
.It Pa /usr/src/Makefile
.It Pa /usr/src/Makefile.inc1
.It Pa /usr/src/release/Makefile
.It Pa /usr/src/release/Makefile.vm
.It Pa /usr/src/release/release.sh
.It Pa /usr/src/release/release.conf.sample
.It Pa /usr/src/release/tools/*.conf
.It Pa /usr/src/release/tools/vmimage.subr
.El
.Sh ПРИМЕРЫ
Для создания
.Dq "-CURRENT snapshot"
можно использовать следующую последовательность команд:
.Bd -literal -offset indent
cd /usr
git clone -b main https://git.freebsd.org/src.git src
cd src
make buildworld buildkernel
cd release
make obj
make release
make install DESTDIR=/var/freebsd-snapshot
.Ed
.Pp
После выполнения этих команд все созданные дистрибутивные файлы
(архивные файлы для FTP, образы CD-ROM и т.д.) будут доступны в каталоге
.Pa /var/freebsd-snapshot .
.Pp
Следующая последовательность команд может быть использована для создания
.Dq "-CURRENT snapshot"
в чистой среде, включая порты и документацию:
.Bd -literal -offset indent
cd /usr/src/release
sh release.sh
.Ed
.Pp
При желании для настройки сборки релиза можно использовать файл конфигурации:
.Bd -literal -offset indent
cd /usr/src/release
sh release.sh -c $HOME/release.conf
.Ed
.Pp
Файлы конфигурации, относящиеся к различным поддерживаемым встраиваемым системам,
таким как Raspberry Pi, находятся в каталоге, соответствующем
.Va TARGET
переменной
.Xr make 1 .
Например, для создания образа для Raspberry Pi:
.Bd -literal -offset indent
cd /usr/src/release
sh release.sh -c arm/RPI-B.conf
.Ed
.Pp
Как создать образ для Raspberry Pi 3:
.Bd -literal -offset indent
cd /usr/src/release
sh release.sh -c arm64/RPI3.conf
.Ed
.Pp
После выполнения этих команд все подготовленные файлы релиза будут доступны в каталоге
.Pa /scratch .
Целевой каталог можно изменить, указав переменную
.Va CHROOTDIR
в
.Li release.conf .
.Sh СОВМЕСТИМОСТЬ
Целевой объект reldoc был удален при фиксации f61e92ca5a23, и поэтому
.Ev DOCDIR ,
.Ev DOCBRANCH ,
.Ev DOC_UPDATE_SKIP ,
и
.Ev NODOC
больше не поддерживаются.
.Sh СМОТРИТЕ ТАКЖЕ
.Xr cc 1 ,
.Xr git 1 Pq Pa ports/devel/git ,
.Xr install 1 ,
.Xr make 1 ,
.Xr mkimg 1 ,
.Xr uname 1 ,
.Xr md 4 ,
.Xr make.conf 5 ,
.Xr build 7 ,
.Xr ports 7 ,
.Xr chroot 8 ,
.Xr mtree 8 ,
.Xr sysctl 8
.Rs
.%T "Разработка релиза FreeBSD"
.%U https://docs.freebsd.org/en/articles/freebsd-releng/
.Re
.Rs
.%T "Руководство для разработчиков FreeBSD"
.%U https://docs.freebsd.org/en/books/developers-handbook/
.Re
.Sh ИСТОРИЯ
Для выпуска
.Fx
1.x
uиспользовался ручной контрольный список, составленный
.An Rod Grimes .
Помимо того, что этот список был неполным,
он предъявлял множество специфических требований
к доступным файловым системам и был довольно сложным в исполнении.
.Pp
В рамках разработки релиза
.Fx 2.0
были потрачены значительные усилия на приведение
.Pa src/release/Makefile
к такому виду, при котором он мог бы, по крайней мере,
автоматизировать большую часть трудоемкой работы по созданию
релиза в стерильной среде.
.Pp
Для релиза
.Fx 9.0 ,
был переработан файл
.Pa src/release/Makefile
и добавлен сценарий-оболочка
.Pa src/release/generate-release.sh
для поддержки внедрения нового установщика.
.Pp
В версии
.Fx 9.2
.Pa src/release/release.sh
была введена поддержка конфигурационных файлов для каждой сборки.
.Pa src/release/release.sh
загружен только на основе скрипта
.Pa src/release/generate-release.sh .
.Pp
Журнал
.Xr git 1
.Pa src/release/Makefile
содержит около 1000 правок, разбросанных по нескольким ветвям, и содержит яркие исторические записи о некоторых
трудностях, с которыми сталкиваются разработчики релизов.
.Sh АВТОРЫ
Изначально
.Pa src/release/Makefile
был написан
.An -nosplit
.An Rod Grimes ,
.An Jordan Hubbard ,
и
.An Poul-Henning Kamp .
.Pp
Эта страница руководства была первоначально написана
.An Murray Stokely Aq Mt murray@FreeBSD.org .
.Pp
Она была обновлена
.An Nathan Whitehorn Aq Mt nwhitehorn@FreeBSD.org
чтобы включить в
.Fa generate-release.sh
скрипт, используемый для цикла релиза
.Fx 9.0 .
.Pp
Позже он был обновлен
.An Glen Barber Aq Mt gjb@FreeBSD.org
чтобы включить в него скрипт
.Fa release.sh ,
использовавшийся в цикле релиза
.Fx 9.2 .
